# Pandas

# **Pandas nədir?** <a id="2"></a>
Pandas  tabular data ilə rahat işləmək üçün istifadə olunan open-source python kitabxanasıdır.

# **Pandas kitabxanası** <a id="3"></a>
<hr>

In [17]:
import numpy as np 
import pandas as pd # import in pandas
from IPython.display import Image

# **Pandas Data Strukturu** <a id="4"></a>
<hr>

Pandas-da iki data strukturu var. Bunlar series və dataframe-dir.

### **Series** <a id="5"></a>

Series bir-ölçülü etiketlənmiş array-dir. İçinə hər hansı bir tip data yerləşdirə bilər.

In [3]:
mySeries = pd.Series([3,-5,7,4], index=['a','b','c','d'])
mySeries

a    3
b   -5
c    7
d    4
dtype: int64

In [4]:
type(mySeries)

pandas.core.series.Series

### **DataFrame** <a id="6"></a>

Dataframe iki-ölçülü data strukturudur. Dataframe-lər sütunlarla işləyir.

In [5]:
data = {'Country' : ['Belgium', 'India', 'Brazil' ],
        'Capital': ['Brussels', 'New Delhi', 'Brassilia'],
        'Population': [1234,1234,1234]}
datas = pd.DataFrame(data, columns=['Country','Capital','Population'])
datas

   Country    Capital  Population
0  Belgium   Brussels        1234
1    India  New Delhi        1234
2   Brazil  Brassilia        1234

In [6]:
print(type(data))
print(type(datas))

<class 'dict'>
<class 'pandas.core.frame.DataFrame'>

# **Import Library** <a id="7"></a>
<hr>


Pandas ilə CSV, Excel və SQL bazalarını aça bilərik. Bu metodun yalnız CSV və Excel faylları üçün necə istifadə ediləcəyini göstərəcəm.

### **CSV(comma - separated values)** <a id="8"></a>

CSV fayllarını açmaq və oxumaq çox asandır və CSV faylını yenidən yazmaq da asandır.

In [7]:
df = pd.read_csv('StockPrices.csv')
type(df)
# Əgər Python faylı ilə CSV faylının yerində deyilsə, bu şəkildə bu şəkildə yapılmalıdır.
# df = pd.read_csv('/home/desktop/Iris.csv')

pandas.core.frame.DataFrame

### **Excel** <a id="9"></a>

In [5]:
# pd.read_excel('filename')
# pd.to_excel('dir/dataFrame.xlsx', sheet_name='Sheet1')

# **DataFrame yaradılması** <a id="12"></a>
<mark>[ ](#0)
<hr>

In [8]:
pd.DataFrame(np.random.rand(20,5)) # 5 sütun və 20 sətir

           0         1         2         3         4
0   0.342499  0.070522  0.204225  0.660444  0.297547
1   0.731301  0.991722  0.107624  0.546981  0.301043
2   0.344547  0.004509  0.743975  0.920044  0.678128
3   0.156291  0.846931  0.099024  0.630790  0.066022
4   0.359270  0.495790  0.978261  0.402193  0.070037
5   0.385741  0.643922  0.813919  0.699281  0.792407
6   0.910513  0.214008  0.509478  0.336121  0.214665
7   0.204943  0.079375  0.205522  0.032204  0.412043
8   0.615615  0.313284  0.489592  0.179026  0.198381
9   0.468463  0.235842  0.772537  0.507307  0.425646
10  0.901363  0.680534  0.960105  0.394168  0.737046
11  0.679882  0.749769  0.559883  0.607470  0.166974
12  0.159164  0.601377  0.893614  0.052709  0.452417
13  0.618674  0.311397  0.258769  0.437074  0.127128
14  0.560385  0.730212  0.561764  0.926147  0.166771
15  0.886574  0.053514  0.026709  0.627216  0.588403
16  0.195881  0.012497  0.210902  0.696229  0.630642
17  0.334311  0.105646  0.379632  0.833760  0.584436
18  0.910727  0.869369  0.879744  0.442520  0.957062
19  0.843502  0.586784  0.497206  0.620127  0.802700

# **Data haqda ümumi məlumat** <a id="13"></a>
 
<hr>

### **df.info()** <a id="14"></a>
Bu kod data haqqında ümumi məlumat verir.

* **RangeIndex:** dataframe-dən əvvəlki sətirlər arasındakı index
* **Data Columns:** dataframe-dən sütunlar
* **Columns:** dataframe-dən sütunların adları
* **dtypes:** dataframe-dən sütunların tipi
* **Memory Usage:** dataframe-dən istifadə edilən memory-i

 
<hr>

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1989 entries, 0 to 1988
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       1989 non-null   object
 1   Open       1989 non-null   float64
 2   High       1989 non-null   float64
 3   Low        1989 non-null   float64
 4   Close      1989 non-null   float64
 5   Volume     1989 non-null   int64
 6   Adj Close  1989 non-null   float64
dtypes: float64(5), int64(1), object(1)
memory usage: 108.9+ KB

### **df.shape()** <a id="15"></a>
Burda dataframe-dən sətirlər və sütunların sayını göstərir.

 
<hr>

In [10]:
df.shape

(1989, 7)

### **df.index** <a id="16"></a>
Bu kod ümumi index sayını göstərir.

 
<hr>

In [11]:
df.index

RangeIndex(start=0, stop=1989, step=1)

### **df.columns** <a id="17"></a>
Bu kod dataframe-dən sütunların adlarını göstərir.

 
<hr>

In [12]:
df.columns

Index(['Date', 'Open', 'High', 'Low', 'Close', 'Volume', 'Adj Close'], dtype='object')

### **df.count()** <a id="18"></a>
Bu kod hər sütunda olan data-lərin sayını göstərir.

 
<hr>

In [13]:
df.count()

Date         1989
Open         1989
High         1989
Low          1989
Close        1989
Volume       1989
Adj Close    1989
dtype: int64

### **df.min()** <a id="21"></a>
Bu kod hər sütunda olan data-lərin minimumunu göstərir.

 
<hr>

In [14]:
df.min()

Date          2008-08-08
Open         6547.009766
High         6709.609863
Low          6469.950195
Close        6547.049805
Volume           8410000
Adj Close    6547.049805
dtype: object

### **df.max()** <a id="22"></a>
Bu kod hər sütunda olan data-lərin maksimumunu göstərir.
 
<hr>

In [15]:
df.max()

Date           2016-07-01
Open         18315.060547
High         18351.359375
Low          18272.560547
Close        18312.390625
Volume          674920000
Adj Close    18312.390625
dtype: object

### **df.describe()**  <a id="25"></a>
This Code provides basic statistical information about the data. The numerical column is based.
Bu kod dataframe-dən sütunların ümumi statistikalarını göstərir.

* **count:** dataframe-də ümumi data sayı
* **mean: **dataframe-dən ümumi data-lərin ortalaması
* **std:** dataframe-dən ümumi data-lərin standart deviation-u
* **min:** dataframe-dən ümumi data-lərin minimumu
* **25%:** dataframe-dən ümumi data-lərin 25%-ının yeri
* **50%:** dataframe-dən ümumi data-lərin 50%-ının yeri
* **75%:** dataframe-dən ümumi data-lərin 75%-ının yeri
* **max:** dataframe-dən ümumi data-lərin maximumu

 
<hr>

![](https://miro.medium.com/max/1400/1*vMcoKXjQzmIfsxQdEEC6kQ.jpeg)

In [21]:
df.describe()

,Open,High,Low,Close,Volume,Adj Close
count,1989.000000,1989.000000,1989.000000,1989.000000,1.989000e+03,1989.000000
mean,13459.116048,13541.303173,13372.931728,13463.032255,1.628110e+08,13463.032255
std,3143.281634,3136.271725,3150.420934,3144.006996,9.392343e+07,3144.006996
min,6547.009766,6709.609863,6469.950195,6547.049805,8.410000e+06,6547.049805
25%,10907.339844,11000.980469,10824.759766,10913.379883,1.000000e+08,10913.379883
50%,13022.049805,13088.110352,12953.129883,13025.580078,1.351700e+08,13025.580078
75%,16477.699219,16550.070312,16392.769531,16478.410156,1.926000e+08,16478.410156
max,18315.060547,18351.359375,18272.560547,18312.390625,6.749200e+08,18312.390625

### **df.mean()**  <a id="26"></a>
Bu kod dataframe-dən sütunların ortalamasını göstərir.

 
<hr>

In [22]:
df.mean()

C:\Users\aliyu\AppData\Local\Temp\ipykernel_13104\3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

Open         1.345912e+04
High         1.354130e+04
Low          1.337293e+04
Close        1.346303e+04
Volume       1.628110e+08
Adj Close    1.346303e+04
dtype: float64

### **df.median()**  <a id="27"></a>
Bu kod dataframe-dən sütunların medianlarını göstərir.

 
<hr>

In [23]:
df.median()

C:\Users\aliyu\AppData\Local\Temp\ipykernel_13104\530051474.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.median()

Open         1.302205e+04
High         1.308811e+04
Low          1.295313e+04
Close        1.302558e+04
Volume       1.351700e+08
Adj Close    1.302558e+04
dtype: float64

### **df.quantile([0.25,0.75])**  <a id="28"></a>
Bu kod dataframe-dən sütunların 0.25 və 0.75-inin yeri göstərir.

 
<hr>

In [24]:
df.quantile([0.25,0.75])

,Open,High,Low,Close,Volume,Adj Close
0.25,10907.339844,11000.980469,10824.759766,10913.379883,100000000.0,10913.379883
0.75,16477.699219,16550.070312,16392.769531,16478.410156,192600000.0,16478.410156

### **df.std()** <a id="30"></a>
Bu kod dataframe-dən sütunların standart deviation-u göstərir.

 
<hr>

In [25]:
df.std()

C:\Users\aliyu\AppData\Local\Temp\ipykernel_13104\3390915376.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.std()

Open         3.143282e+03
High         3.136272e+03
Low          3.150421e+03
Close        3.144007e+03
Volume       9.392343e+07
Adj Close    3.144007e+03
dtype: float64

### **len(df)** <a id="34"></a>
Bu kod dataframe-dən ümumi data sayını göstərir.

 
<hr>

In [26]:
len(df)

1989

### **df.isnull()** <a id="35"></a>
Bu kod dataframe-dən null-lər varmı yoxlayır. True və ya False qaytarır.

 
<hr>

In [27]:
df.isnull().head()

    Date   Open   High    Low  Close  Volume  Adj Close
0  False  False  False  False  False   False      False
1  False  False  False  False  False   False      False
2  False  False  False  False  False   False      False
3  False  False  False  False  False   False      False
4  False  False  False  False  False   False      False

### **df.corr()** <a id="81"></a>
Bu kod dataframe-dən sütunların korelasyonlarını göstərir.

 
<hr>

In [28]:
df.corr()

               Open      High       Low     Close    Volume  Adj Close
Open       1.000000  0.999592  0.999436  0.998991 -0.691621   0.998991
High       0.999592  1.000000  0.999373  0.999546 -0.686997   0.999546
Low        0.999436  0.999373  1.000000  0.999595 -0.699572   0.999595
Close      0.998991  0.999546  0.999595  1.000000 -0.694281   1.000000
Volume    -0.691621 -0.686997 -0.699572 -0.694281  1.000000  -0.694281
Adj Close  0.998991  0.999546  0.999595  1.000000 -0.694281   1.000000

# **Seçmə & Filterləmə** <a id="36"></a>
 
<hr>

Pandas ilə data seçmə və filtrelemə kodlarının yaradılması.

### **df[n:n]** <a id="38"></a>
Bu kod N-dən N-ə qədər data götürür.

 
<hr>

In [29]:
df[1982:]
#Or
#df[5:7]

,Date,Open,High,Low,Close,Volume,Adj Close
1982,2008-08-18,11659.650391,11690.429688,11434.120117,11479.389648,156290000,11479.389648
1983,2008-08-15,11611.209961,11709.889648,11599.730469,11659.900391,215040000,11659.900391
1984,2008-08-14,11532.070312,11718.280273,11450.889648,11615.929688,159790000,11615.929688
1985,2008-08-13,11632.809570,11633.780273,11453.339844,11532.959961,182550000,11532.959961
1986,2008-08-12,11781.700195,11782.349609,11601.519531,11642.469727,173590000,11642.469727
1987,2008-08-11,11729.669922,11867.110352,11675.530273,11782.349609,183190000,11782.349609
1988,2008-08-08,11432.089844,11759.959961,11388.040039,11734.320312,212830000,11734.320312

### **df.iloc[[n],[n]]** <a id="39"></a>
Bu kod dataframe-dən N-ci sətirdəki və N-ci sütundakı data-ları götürür.

 
<hr>

In [30]:
df.iloc[[0],[3]]

            Low
0  17916.910156

### **df.loc[n:n]** <a id="40"></a>
Bu kod xüsusi aralıqda olan data-ları götürür.

 
<hr>

In [31]:
#df.loc[n:]
# OR
df.loc[5:7]

,Date,Open,High,Low,Close,Volume,Adj Close
5,2016-06-24,17946.630859,17946.630859,17356.339844,17400.750000,239000000,17400.750000
6,2016-06-23,17844.109375,18011.070312,17844.109375,18011.070312,98070000,18011.070312
7,2016-06-22,17832.669922,17920.160156,17770.359375,17780.830078,89440000,17780.830078

### **df['columnName']** <a id="41"></a>
Bu kod istədiyimiz sütunu götürür.

 
<hr>

In [32]:
df['Open'].head()
# OR
# df.Open

0    17924.240234
1    17712.759766
2    17456.019531
3    17190.509766
4    17355.210938
Name: Open, dtype: float64

### **df['columnName'][n]** <a id="42"></a>
Bu kod istədiyimiz sütundakı N-ci data-nı götürür.
 
<hr>

In [33]:
df['Open'][0]
# OR
# df.Open[0]
# df["Open"][1]
# df.loc[1,["Open"]]

17924.240234

### **df['columnName'].nunique()** <a id="43"></a>
Bu kod sütundakı unique data-ların sayını göstərir.

 
<hr>

In [34]:
df['Open'].nunique()

1980

### **df['columnName'].unique()** <a id="44"></a>
Bu kod unique data-ları göstərir.

 
<hr>

In [35]:
df['Open'].unique()
# We can write the above code as follows:: df.Open.unique()

array([17924.240234, 17712.759766, 17456.019531, ..., 11781.700195,
       11729.669922, 11432.089844])

### **df.head(n)** <a id="47"></a>
Bu kod ilk 5 data götürür. N yerinə istədiyiniz data sayını qoyaraq onu götürə bilərsiniz.

 
<hr>

In [36]:
df.head()
# OR
# df.head(15)

,Date,Open,High,Low,Close,Volume,Adj Close
0,2016-07-01,17924.240234,18002.380859,17916.910156,17949.369141,82160000,17949.369141
1,2016-06-30,17712.759766,17930.609375,17711.800781,17929.990234,133030000,17929.990234
2,2016-06-29,17456.019531,17704.509766,17456.019531,17694.679688,106380000,17694.679688
3,2016-06-28,17190.509766,17409.720703,17190.509766,17409.720703,112190000,17409.720703
4,2016-06-27,17355.210938,17355.210938,17063.080078,17140.240234,138740000,17140.240234

### **df.tail(n)** <a id="48"></a>
Bu kod son 5 data götürür. N yerinə istədiyiniz data sayını qoyaraq onu götürə bilərsiniz.

 
<hr>

In [37]:
df.tail()
# OR
# df.tail(20)

,Date,Open,High,Low,Close,Volume,Adj Close
1984,2008-08-14,11532.070312,11718.280273,11450.889648,11615.929688,159790000,11615.929688
1985,2008-08-13,11632.809570,11633.780273,11453.339844,11532.959961,182550000,11532.959961
1986,2008-08-12,11781.700195,11782.349609,11601.519531,11642.469727,173590000,11642.469727
1987,2008-08-11,11729.669922,11867.110352,11675.530273,11782.349609,183190000,11782.349609
1988,2008-08-08,11432.089844,11759.959961,11388.040039,11734.320312,212830000,11734.320312

### **df.sample(n)** <a id="49"></a>
Bu kod data-dan random n data götürür.

 
<hr>

In [38]:
df.sample(5)

,Date,Open,High,Low,Close,Volume,Adj Close
1013,2012-06-21,12823.099609,12857.389648,12561.459961,12573.570312,146750000,12573.570312
1660,2009-11-25,10432.959961,10481.480469,10420.940430,10464.400391,130080000,10464.400391
509,2014-06-25,16817.679688,16883.539062,16799.410156,16867.509766,73920000,16867.509766
565,2014-04-04,16576.019531,16631.630859,16392.769531,16412.710938,104350000,16412.710938
1424,2010-11-03,11184.879883,11226.639648,11097.370117,11215.129883,177580000,11215.129883

### **df[df.columnName < 5]** <a id="53"></a>
Bu kod sütunda 5-dən kiçik olan data-ları götürür.

 
<hr>

In [39]:
df[df.Open > 18281.949219]

,Date,Open,High,Low,Close,Volume,Adj Close
280,2015-05-22,18286.869141,18286.869141,18217.140625,18232.019531,78890000,18232.019531
281,2015-05-21,18285.869141,18314.890625,18249.900391,18285.740234,84270000,18285.740234
282,2015-05-20,18315.060547,18350.130859,18272.560547,18285.400391,80190000,18285.400391
283,2015-05-19,18300.480469,18351.359375,18261.349609,18312.390625,87200000,18312.390625

### **df[['columnName','columnName']]** <a id="54"></a>
Bu kod istədiyimiz sütunları götürür.

 
<hr>

In [40]:
df[['High','Low']].head()
# df.loc[:,["High","Low"]]

           High           Low
0  18002.380859  17916.910156
1  17930.609375  17711.800781
2  17704.509766  17456.019531
3  17409.720703  17190.509766
4  17355.210938  17063.080078

### **df.loc[:,"columnName1":"columnName2"]** <a id="55"></a>
Bu kod sütun adları arasındakı sütunları götürür.

 
<hr>

In [41]:
df.loc[:,"Date":"Close"].head()
# OR
# data.loc[:3,"Date":"Close"]

         Date          Open          High           Low         Close
0  2016-07-01  17924.240234  18002.380859  17916.910156  17949.369141
1  2016-06-30  17712.759766  17930.609375  17711.800781  17929.990234
2  2016-06-29  17456.019531  17704.509766  17456.019531  17694.679688
3  2016-06-28  17190.509766  17409.720703  17190.509766  17409.720703
4  2016-06-27  17355.210938  17355.210938  17063.080078  17140.240234

### **Filter yaratmaq** <a id="56"></a>
 
<hr>

In [42]:
filters = df.Date > '2016-06-27'
df[filters]

,Date,Open,High,Low,Close,Volume,Adj Close
0,2016-07-01,17924.240234,18002.380859,17916.910156,17949.369141,82160000,17949.369141
1,2016-06-30,17712.759766,17930.609375,17711.800781,17929.990234,133030000,17929.990234
2,2016-06-29,17456.019531,17704.509766,17456.019531,17694.679688,106380000,17694.679688
3,2016-06-28,17190.509766,17409.720703,17190.509766,17409.720703,112190000,17409.720703

### **& ilə filterləmə** <a id="59"></a>
 
<hr>

In [43]:
df[(df['Open']>18281.949219) & (df['Date']>'2015-05-20')]

,Date,Open,High,Low,Close,Volume,Adj Close
280,2015-05-22,18286.869141,18286.869141,18217.140625,18232.019531,78890000,18232.019531
281,2015-05-21,18285.869141,18314.890625,18249.900391,18285.740234,84270000,18285.740234

# **Data sortlanması** <a id="60"></a>

 
<hr>

### **df.sort_values('columnName')** <a id="61"></a>
This code sorts the column we specify in the form of low to high.
Bu kod göstərdiyimiz sütunu kiçikdən böyüyə doğru sort edir.

# **Data sortlanması** <a id="60"></a>

 
<hr>

### **df.sort_values('columnName')** <a id="61"></a>
This code sorts the column we specify in the form of low to high.
Bu kod göstərdiyimiz sütunu kiçikdən böyüyə doğru sort edir.

In [44]:
df.sort_values('Open').head()

,Date,Open,High,Low,Close,Volume,Adj Close
1842,2009-03-10,6547.009766,6926.490234,6546.609863,6926.490234,640020000,6926.490234
1844,2009-03-06,6595.160156,6755.169922,6469.950195,6626.939941,425170000,6626.939941
1843,2009-03-09,6625.740234,6709.609863,6516.859863,6547.049805,365990000,6547.049805
1846,2009-03-04,6726.500000,6979.220215,6726.419922,6875.839844,464830000,6875.839844
1847,2009-03-03,6764.810059,6855.290039,6705.629883,6726.020020,445280000,6726.020020

### **df.sort_values('columnName', ascending=False)** <a id="62"></a>
Bu kod göstərdiyimiz sütunu böyükdən kiçiyə doğru sort edir.

 
<hr>

In [56]:
df.sort_values('Date', ascending=False).head()

,Date,Open,High,Low,Close,Volume,Adj Close
0,2016-07-01,17924.240234,18002.380859,17916.910156,17949.369141,82160000,17949.369141
1,2016-06-30,17712.759766,17930.609375,17711.800781,17929.990234,133030000,17929.990234
2,2016-06-29,17456.019531,17704.509766,17456.019531,17694.679688,106380000,17694.679688
3,2016-06-28,17190.509766,17409.720703,17190.509766,17409.720703,112190000,17409.720703
4,2016-06-27,17355.210938,17355.210938,17063.080078,17140.240234,138740000,17140.240234

### **df.sort_index()** <a id="63"></a>
Bu kod dataframe-in index-ə görə kiçikdən böyüyə doğru sort edir.

 
<hr>

In [45]:
df.sort_index().head()

,Date,Open,High,Low,Close,Volume,Adj Close
0,2016-07-01,17924.240234,18002.380859,17916.910156,17949.369141,82160000,17949.369141
1,2016-06-30,17712.759766,17930.609375,17711.800781,17929.990234,133030000,17929.990234
2,2016-06-29,17456.019531,17704.509766,17456.019531,17694.679688,106380000,17694.679688
3,2016-06-28,17190.509766,17409.720703,17190.509766,17409.720703,112190000,17409.720703
4,2016-06-27,17355.210938,17355.210938,17063.080078,17140.240234,138740000,17140.240234

# **Sütun adlandırma** <a id="64"></a>
 
<hr>

### **df.rename(columns= {'columnName' : 'newColumnName'})** <a id="65"></a>
Bu kod sütun adını dəyişməyə kömək edir. Aşağıda yazdığım kod ID dəyərini dəyişdirir, lakin dəyişikliyi DF dəyişəninə təyin etmədikdən görünmür.

In [46]:
df.rename(columns= {'Adj Close' : 'Adjclose'}).head()
# df = df.rename(columns= {'Id' : 'Identif'}, inplace=True) -> True way
# inplace= True or False; This meaning, overwrite the data set.
# Other Way
# df.columns = ['date', 'open', 'high', 'low', 'close', 'volume', 'adjclose']

,Date,Open,High,Low,Close,Volume,Adjclose
0,2016-07-01,17924.240234,18002.380859,17916.910156,17949.369141,82160000,17949.369141
1,2016-06-30,17712.759766,17930.609375,17711.800781,17929.990234,133030000,17929.990234
2,2016-06-29,17456.019531,17704.509766,17456.019531,17694.679688,106380000,17694.679688
3,2016-06-28,17190.509766,17409.720703,17190.509766,17409.720703,112190000,17409.720703
4,2016-06-27,17355.210938,17355.210938,17063.080078,17140.240234,138740000,17140.240234

###  **Yeni sütun** <a id="66"></a>
Yeni sütun yaratmaq

 
<hr>

In [47]:
df["Difference"] = df.High - df.Low
df.head()

,Date,Open,High,Low,Close,Volume,Adj Close,Difference
0,2016-07-01,17924.240234,18002.380859,17916.910156,17949.369141,82160000,17949.369141,85.470703
1,2016-06-30,17712.759766,17930.609375,17711.800781,17929.990234,133030000,17929.990234,218.808594
2,2016-06-29,17456.019531,17704.509766,17456.019531,17694.679688,106380000,17694.679688,248.490235
3,2016-06-28,17190.509766,17409.720703,17190.509766,17409.720703,112190000,17409.720703,219.210937
4,2016-06-27,17355.210938,17355.210938,17063.080078,17140.240234,138740000,17140.240234,292.130860

### **Sütun adlarını kiçik hərfə keçirmək** <a id="68"></a>
 
<hr>

In [48]:
#df.columns = map(str.lower(), df.columns)

### **Sütun adlarını böyük hərfə keçirmək** <a id="69"></a>
 
<hr>

In [49]:
#df.columns = map(str.upper(), df.columns)

# **Datanın silinməsi** <a id="70"></a>

 
<hr>

### **df.drop(columns=['columnName'])** <a id="71"></a>
Bu kod göstərdiyimiz sütunu silir. Lakin yuxarıda yazdığım kimi silməni DF dəyişəninə təyin etmədikdən görünmür.

In [50]:
df.drop(columns=['Adj Close']).head()
# df = df.drop(columns=['Id']) -> True way
# OR
# df = df.drop('col', axis=1)
# axis = 1 is meaning delete columns
# axis = 0 is meaning delete rows

,Date,Open,High,Low,Close,Volume,Difference
0,2016-07-01,17924.240234,18002.380859,17916.910156,17949.369141,82160000,85.470703
1,2016-06-30,17712.759766,17930.609375,17711.800781,17929.990234,133030000,218.808594
2,2016-06-29,17456.019531,17704.509766,17456.019531,17694.679688,106380000,248.490235
3,2016-06-28,17190.509766,17409.720703,17190.509766,17409.720703,112190000,219.210937
4,2016-06-27,17355.210938,17355.210938,17063.080078,17140.240234,138740000,292.130860

### **Sətir silinməsi** <a id="82"></a>

 
<hr>

In [51]:
# df.drop(['2016-07-01', '2016-06-27'])

### **Sütun silinməsi** <a id="83"></a>

 
<hr>
Note: axis=1, sütunu silməyimiz üçündür

In [52]:
# df.drop('Volume', axis=1)

# **Data tipinin dəyişdirilməsi/** <a id="73"></a>

 
<hr>

### **df.dtypes** <a id="74"></a>
Bu kod sütunların data tipini göstərir. Boolean, int, float, object(String), date.

In [53]:
df.dtypes

Date           object
Open          float64
High          float64
Low           float64
Close         float64
Volume          int64
Adj Close     float64
Difference    float64
dtype: object

### **df['columnName'] = df['columnName'].astype('dataType')** <a id="75"></a>
Bu kod göstərdiyimiz sütunu göstərdiyimiz data tipinə çevirir.

 
<hr>

In [54]:
df.Volume.astype('float').dtypes
# OR Convert Datetime
# df.Date= pd.to_datetime(df.Date)

dtype('float64')

# **Lambda** <a id="77"></a>

 
<hr>

### **Metod 1** <a id="78"></a>

In [55]:
def examples(x):   #funksiya yaratmaq
    return x*2

df.Open.apply(examples).head()  #funksiyanı uygulamaq

0    35848.480468
1    35425.519532
2    34912.039062
3    34381.019532
4    34710.421876
Name: Open, dtype: float64

### **Method 2** <a id="79"></a>

In [56]:
df.Open.apply(lambda x: x*2).head()

0    35848.480468
1    35425.519532
2    34912.039062
3    34381.019532
4    34710.421876
Name: Open, dtype: float64

# Resurslar
* [w3schools-Pandas Tutorial](https://www.w3schools.com/python/pandas/default.asp)
* [Pandas Documentation](https://pandas.pydata.org/docs/getting_started/tutorials.html)
* [Pandas Cheat Sheet](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf)
* [Keith Galli-Pandas Tutorial](https://www.youtube.com/watch?v=vmEHCJofslg)